### Pandas
-  Panadas is a Python library used for working with data sets.

###
- Pandas is a Python libary uesd for working with data sets.
   
   - panadas allows us to analyse big data and make conclusion based based on statisticals,
   - pandas  can clean messy data sets , and make them readable and relavent.
   - relevant data is very important in data science.

### Pandas data Stucture 
 
- Series (1- dim)
- DataFrame(2- dim)

### Series

In [20]:
A series is a one-dim labeled array in pandas . it can hold data of various type , include integer , float, strings, and many more

SyntaxError: invalid syntax (3732626451.py, line 1)

### Creating series 

- list
- tuple
- dic
- array

### Import libary

In [21]:
import pandas as pd

In [22]:
l1 = [100,200,300,400,500,600]
l1

[100, 200, 300, 400, 500, 600]

In [23]:
import pandas as pd

a1 = pd.Series(l1)
a1

0    100
1    200
2    300
3    400
4    500
5    600
dtype: int64

In [24]:
t1 = (100,200,300,400,500,600)
t1

(100, 200, 300, 400, 500, 600)

In [25]:
import pandas as pd

a2 = pd.Series(t1)
a2

0    100
1    200
2    300
3    400
4    500
5    600
dtype: int64

In [26]:
type(a2)

pandas.core.series.Series

### dictionary

In [27]:
dic1 =  {"United States": "Washington D.C.",  "Italy": "Rome",  "England": "London"}
dic1

{'United States': 'Washington D.C.', 'Italy': 'Rome', 'England': 'London'}

In [28]:
s2 = pd.Series(dic1)
s2

United States    Washington D.C.
Italy                       Rome
England                   London
dtype: object

In [29]:
type(s2)

pandas.core.series.Series

In [30]:
import numpy as np
Array1 = ([1, 2, 3, 4, 5])
Array1

[1, 2, 3, 4, 5]

In [31]:
import numpy as np
s3 = pd.Series([1,2,3,4,5])
s3

0    1
1    2
2    3
3    4
4    5
dtype: int64

### Rename

rename -> index
replace-> values


- Syntax
        - variable_name.rename({old_index:new_index,old_index:new_index},inplace= True)

In [32]:
s3

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [33]:
s4 = s3.rename({2:"two"})
s4

0      1
1      2
two    3
3      4
4      5
dtype: int64

replace single  value
- Syntax
        - variable_name.replace({old_index:new_index,old_index:new_index},inplace= True)

In [34]:
s4 = s3.replace(1,'one',inplace = True)
s3

0    one
1      2
2      3
3      4
4      5
dtype: object

###replace Multiple value
- Syntax
        - variable_name.replace([old_value1,old_value2..old_valueN],[New_value, New_value,.....New_valueN],inplace= True)

In [35]:
b1 = [10,20,30,40,50,60,70]
import pandas as pd

s5 = pd.Series(b1)
s5

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [36]:
sort_index()
- variable_name.sort_index()   --> ascending
- variable_name.sort_index(ascending=False)  -->decending

SyntaxError: invalid syntax (1821380763.py, line 2)

In [ ]:
names =['Deoyani','Tanvi','Neha','Rushabh','Sameer','Chaitanya','Alankar','Kapil','Sujit','Pavan']
names

sort_value()

In [ ]:
import pandas as pd

# create a list
data = [10, 20, 30, 40, 50]

# create a series from the list
my_series = pd.Series(data)

print(my_series)

## DataFrame()

- 

- A DataFrame is a two-dimensional labeled data structure in pandas.It's similar to a table in a relational database or an Excel spreadsheet.
-  A DataFrame consists of multiple Series organized as columns, and each column can hold data of different types.

In [ ]:
import pandas as pd

In [37]:
df = pd.read_csv(r"C:\Users\Dell\Downloads\Employee.csv")
df

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [38]:
#head()
df.head(5)

     Id gender    city  experience   salary
0  1001      M    pune           1  10000.0
1  1002      F  mumbai           5  50000.0
2  1003      M    pune           4      NaN
3  1004      M    beed           6  60000.0
4  1005      F    beed           7  70000.0

In [39]:
#tail()
df.tail(5)

      Id gender      city  experience   salary
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [40]:
#Info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Id          15 non-null     int64
 1   gender      15 non-null     object
 2   city        15 non-null     object
 3   experience  15 non-null     int64
 4   salary      14 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 732.0+ bytes

In [41]:
#describe()
df.describe()

                Id  experience        salary
count    15.000000   15.000000     14.000000
mean   1008.000000    4.933333  50000.000000
std       4.472136    2.491892  25720.389996
min    1001.000000    1.000000  10000.000000
25%    1004.500000    3.500000  32500.000000
50%    1008.000000    5.000000  50000.000000
75%    1011.500000    6.500000  67500.000000
max    1015.000000    9.000000  90000.000000

In [42]:
#sample()
df.sample(1)

     Id gender    city  experience   salary
8  1009      F  nagpur           6  60000.0

In [43]:
df.sample(5)

      Id gender    city  experience   salary
11  1012      F  gondia           4  40000.0
8   1009      F  nagpur           6  60000.0
1   1002      F  mumbai           5  50000.0
9   1010      F    pune           3  30000.0
3   1004      M    beed           6  60000.0

### rename

#syntax
 
- variable_name.rename({old_index/column:new_index/column,old_index/column:new_index/column},inplace=True)

In [44]:
df = pd.read_csv(r"C:\Users\Dell\Downloads\Employee.csv")
df

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [ ]:
df.rename({5:100})## rename index

### colume rename

In [ ]:
df.columns

In [ ]:
df.columns = (["col1","col2","col3","col4","col5"])
df

In [ ]:

df1 = pd.DataFrame([[10,20,30],[22,56,78],[4,8,2],[23,67,45]])
df1

In [ ]:

df1.rename({0:'zero'},axis = 1)
df1

In [ ]:
df1.rename({0:"zero"},axis = 1)

# replace only one value

variable_name.replace(old_value,new_value,inplace=True)
Unread messages
variable_name.replace([old_value1,old_value2,old_value3][new_value1,new_value2,new_value3],inplace=True)

In [ ]:
df = pd.read_csv(r"C:\Users\Dell\Downloads\Employee.csv")
df

In [ ]:
df.replace('pune','GONDIA')

In [ ]:
df.replace([1,"F","bhandara"],[0,"Sex","gondia"])

indexing

In [ ]:
iloc --> integrer based  indexing #integer based(index number)
loc ---> Lable based indexing  #categorical

### iloc

- The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to     select a specific row/column.

In [ ]:
df

Selcting rows using indice

In [45]:
df.iloc[[0,2,4,6,8,12,14]]

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
2   1003      M      pune           4      NaN
4   1005      F      beed           7  70000.0
6   1007      F      beed           2  20000.0
8   1009      F    nagpur           6  60000.0
12  1013      F  bhandara           1  10000.0
14  1015      M    nagpur           5  50000.0

In [46]:
df.iloc[[0,2,4,6,8,3,1]]

     Id gender    city  experience   salary
0  1001      M    pune           1  10000.0
2  1003      M    pune           4      NaN
4  1005      F    beed           7  70000.0
6  1007      F    beed           2  20000.0
8  1009      F  nagpur           6  60000.0
3  1004      M    beed           6  60000.0
1  1002      F  mumbai           5  50000.0

Selcting  a range of colume and row simul.

In [47]:
df.iloc[0:5]

     Id gender    city  experience   salary
0  1001      M    pune           1  10000.0
1  1002      F  mumbai           5  50000.0
2  1003      M    pune           4      NaN
3  1004      M    beed           6  60000.0
4  1005      F    beed           7  70000.0

In [48]:
df.iloc[0:5,2:4]

     city  experience
0    pune           1
1  mumbai           5
2    pune           4
3    beed           6
4    beed           7

In [49]:
df.iloc[:,[0,3,4]]

      Id  experience   salary
0   1001           1  10000.0
1   1002           5  50000.0
2   1003           4      NaN
3   1004           6  60000.0
4   1005           7  70000.0
5   1006           5  50000.0
6   1007           2  20000.0
7   1008           8  80000.0
8   1009           6  60000.0
9   1010           3  30000.0
10  1011           9  90000.0
11  1012           4  40000.0
12  1013           1  10000.0
13  1014           8  80000.0
14  1015           5  50000.0

### loc

- the loc() function is label based data selecting method which means that we have to pass the name of the row or column which we want to select.

In [51]:
df.loc[[5],['Id','salary','gender']]

     Id   salary gender
5  1006  50000.0      M

In [53]:
df.loc[(df.salary>= 60000)]

      Id gender    city  experience   salary
3   1004      M    beed           6  60000.0
4   1005      F    beed           7  70000.0
7   1008      F    pune           8  80000.0
8   1009      F  nagpur           6  60000.0
10  1011      M  nagpur           9  90000.0
13  1014      M  gondia           8  80000.0

In [55]:
df.loc[(df.salary>=60000)& (df.gender == 'F') & (df.city== 'nagpur')]

     Id gender    city  experience   salary
8  1009      F  nagpur           6  60000.0

In [57]:
data = pd.read_csv(r"C:\Users\Dell\Downloads\data.csv")
data

   sub1  sub2  sub3  sub4  sub5  sub6
0    50    54    45    65    60    78
1    63    74    54    54    47    50
2    41    58    65    54    45    46
3    78    69    56    65    63    64
4    96    45    60    78    52    52
5    96    45    60    78    52    52
6    35    55    66    77    52    50
7    65    66    45    58    63    63
8    35    55    66    77    52    50

### duplicated()

In [59]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8     True
dtype: bool

In [60]:
data.duplicated().sum()

2

In [62]:
data.duplicated(subset = ['sub5'])

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

### drop_duplicates()

In [63]:
data.drop_duplicates()

   sub1  sub2  sub3  sub4  sub5  sub6
0    50    54    45    65    60    78
1    63    74    54    54    47    50
2    41    58    65    54    45    46
3    78    69    56    65    63    64
4    96    45    60    78    52    52
6    35    55    66    77    52    50
7    65    66    45    58    63    63

### null value check()

In [65]:
df.isnull().any()

Id            False
gender        False
city          False
experience    False
salary         True
dtype: bool

In [66]:
df.isnull().sum()

Id            0
gender        0
city          0
experience    0
salary        1
dtype: int64

Missing Data Handling:
    
    deal with missing value in the Dataframe.

df.dropna()       # Remove rows with missing values

df.fillna(0)      # Replace missing values with 0

df['your_column_name'].fillna(0, inplace=True)  # particular column

df[['column1', 'column2', 'column3']].fillna(0, inplace=True)

In [ ]:
import seaborn as sns

In [ ]:
sns.load_datasets_names()

unique_names = df['Name'].unique()
name_counts = df['Name'].value_counts()

In [69]:
unique_names = data['sub2'].unique()
data

   sub1  sub2  sub3  sub4  sub5  sub6
0    50    54    45    65    60    78
1    63    74    54    54    47    50
2    41    58    65    54    45    46
3    78    69    56    65    63    64
4    96    45    60    78    52    52
5    96    45    60    78    52    52
6    35    55    66    77    52    50
7    65    66    45    58    63    63
8    35    55    66    77    52    50

In [70]:
name_counts = data['sub1'].value_counts()
data

   sub1  sub2  sub3  sub4  sub5  sub6
0    50    54    45    65    60    78
1    63    74    54    54    47    50
2    41    58    65    54    45    46
3    78    69    56    65    63    64
4    96    45    60    78    52    52
5    96    45    60    78    52    52
6    35    55    66    77    52    50
7    65    66    45    58    63    63
8    35    55    66    77    52    50

In [ ]:
d1=pd.DataFrame({'Letter':['A','B','C'],'Number':[1,2,3]})
d1

In [71]:
d2=pd.DataFrame({'Letter':['D','E','F'],'Number':[4,5,6]})
d2

  Letter  Number
0      D       4
1      E       5
2      F       6

#### Merge

The merge () function in pandas combine two or more dataframe by matching rows based on specified colume , aloowing you to creat single  unified dataset.

- inner
- left
- rigth
- outer

pd.merge(dataframe1, dataframe2,on='colume_name','merging_method')

In [2]:
import pandas as pd
a1 = pd.DataFrame({'Name':['komal','kartik','priya'],'Id':[101,102,103],'Cities':['Gondia','Nagpur','Thana']})
a1

     Name   Id  Cities
0   komal  101  Gondia
1  kartik  102  Nagpur
2   priya  103   Thana

In [7]:
a2 = pd.DataFrame({'Name':['komal','ka','ya'],'Id':[10,10,10],'Cities':['dia','Nag','ana']})
a2

    Name  Id Cities
0  komal  10    dia
1     ka  10    Nag
2     ya  10    ana

### Inner

### Inner merge on;y show matching record from both the dataframe3

In [9]:
d3 = pd.merge(a1,a2,on = 'Id',how='inner')
d3

Empty DataFrame
Columns: [Name_x, Id, Cities_x, Name_y, Cities_y]
Index: []